from __future__ import annotations
from aiogram import Router
from aiogram.types import Message, CallbackQuery
from aiogram.filters import Command

from bot.handlers.yoga_feedback.constants import SURVEY_INTRO_TEXT
from bot.handlers.yoga_feedback.keyboards import kb_start_survey
from bot.keyboards import main_menu_kb

router = Router()

@router.message(Command("start"))
async def cmd_start(message: Message, db, cfg):
    await db.upsert_user(message.from_user.id, message.from_user.username, message.from_user.first_name)
    await message.answer(
        "✨ Приветствую тебя! ✨\n"
        "Добро пожаловать в пространство знаний, гармонии и вдохновения.\n"
        "Здесь ты найдёшь:\n"
        "•	🌍 Уроки английского и китайского языков — для уверенного общения и новых возможностей.\n"
        "•	🧘‍♀️ Практики йоги — чтобы обрести баланс тела и ума.\n"
        "•	🔮 Астрологические консультации — для понимания себя и своего пути.\n"
        "•	🧠 Менторскую поддержку — чтобы двигаться вперёд с уверенностью и вдохновением.\n"
        "Я рядом, чтобы помочь тебе расти, открывать новое и чувствовать себя в гармонии с собой и миром.\n"
        
        "Выбери, что тебе сейчас откликается 🤍  \n"
        "Я задам пару вопросов и подберу формат взаимодейтсвия для тебя ✨",
        reply_markup=main_menu_kb()
    )

@router.message(Command("menu"))
async def cmd_menu(message: Message):
    await message.answer("✨ Приветствую тебя! ✨\n"
        "Добро пожаловать в пространство знаний, гармонии и вдохновения.\n"
        "Здесь ты найдёшь:\n"
        "•	🌍 Уроки английского и китайского языков — для уверенного общения и новых возможностей.\n"
        "•	🧘‍♀️ Практики йоги — чтобы обрести баланс тела и ума.\n"
        "•	🔮 Астрологические консультации — для понимания себя и своего пути.\n"
        "•	🧠 Менторскую поддержку — чтобы двигаться вперёд с уверенностью и вдохновением.\n"
        "Я рядом, чтобы помочь тебе расти, открывать новое и чувствовать себя в гармонии с собой и миром.\n"
        
        "Выбери, что тебе сейчас откликается 🤍 \n"
        "Я задам пару вопросов и подберу формат взаимодейтсвия для тебя ✨",
    reply_markup=main_menu_kb())

@router.callback_query(lambda c: c.data == "menu")
async def cb_menu(call: CallbackQuery):
    await call.message.edit_text("✨ Приветствую тебя! ✨\n"
        "Добро пожаловать в пространство знаний, гармонии и вдохновения.\n"
        "Здесь ты найдёшь:\n"
        "•	🌍 Уроки английского и китайского языков — для уверенного общения и новых возможностей.\n"
        "•	🧘‍♀️ Практики йоги — чтобы обрести баланс тела и ума.\n"
        "•	🔮 Астрологические консультации — для понимания себя и своего пути.\n"
        "•	🧠 Менторскую поддержку — чтобы двигаться вперёд с уверенностью и вдохновением.\n"
        "Я рядом, чтобы помочь тебе расти, открывать новое и чувствовать себя в гармонии с собой и миром.\n"
        
        "Выбери, что тебе сейчас откликается 🤍  \n"
        "Я задам пару вопросов и подберу формат взаимодейтсвия для тебя ✨", reply_markup=main_menu_kb())
    await call.answer()



@router.message(Command("feedback_test"))
async def feedback_test(message: Message):
    await message.answer(
        SURVEY_INTRO_TEXT,
        reply_markup=kb_start_survey(999).as_markup()
    )

@router.message(Command("run_feedback_job"))
async def run_feedback_job(message: Message, db, cfg):
    from bot.jobs import send_yoga_feedback_surveys
    await send_yoga_feedback_surveys(bot=message.bot, db=db, cfg=cfg)
    await message.answer("job executed")

# @router.callback_query()
# async def debug_any_callback(q: CallbackQuery):
#     print("DEBUG CALLBACK:", q.data)
#     await q.answer("ok")
